openfoam/cases/wigley/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-12 0 -8)
    ( 21 0 -8)
    ( 21 8 -8)
    (-12 8 -8)
    (-12 0  8)
    ( 21 0  8)
    ( 21 8  8)
    (-12 8  8)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (33 8 16) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces ( (0 4 7 3) );
    }
    outlet
    {
        type patch;
        faces ( (2 6 5 1) );
    }
    symmetry
    {
        type symmetryPlane;
        faces ( (1 5 4 0) );
    }
    farfield
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
