openfoam/cases/wigley/0/p
FoamFile { format ascii; class volScalarField; object p; }
#include "include/initialConditions"
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform $pressure;
boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet    { type zeroGradient; }
    outlet   { type fixedValue; value $internalField; }
    hull     { type zeroGradient; }
    farfield { type zeroGradient; }
}
