openfoam/cases/wigley/0/nut
FoamFile { format ascii; class volScalarField; location "0"; object nut; }
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet    { type calculated; value uniform 0; }
    outlet   { type calculated; value uniform 0; }
    hull     { type nutkWallFunction; value uniform 0; }
    farfield { type calculated; value uniform 0; }
}
